app/controllers/api/locations_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        @location = Location.find(params[:id])

INSERT INTO "locations" ("route_id", "sequence", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["route_id", 39], ["sequence", 10], ["lat", 40.7086572], ["lng", -74.0008724], ["created_at", "2020-04-10 19:32:31.215968"], ["updated_at", "2020-04-10 19:32:31.215968"]]
---
    def create
        @location = Location.new(location_params)

        if @location.save

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT "locations"."id" FROM "locations" WHERE "locations"."route_id" = $1  [["route_id", 87]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "locations" SET "sequence" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["sequence", 999], ["updated_at", "2020-04-10 19:42:17.842432"], ["id", 20]]
---
    def update
        # debugger
        if current_user
            @location = current_user.routes.locations.find(params[:id])
        else
            @location = Location.find(params[:id])
        end

        if @location.update(location_params)

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 19]]
---
    def destroy
        # debugger
        @location = Location.find(params[:id])
        if @location.destroy