app/controllers/api/routes_controller.rb

    def index
        # For Testing
        # debugger
        if current_user
            @routes = current_user.routes
        else
            @routes = Route.all
---
SELECT "routes".* FROM "routes" WHERE "routes"."user_id" = $1  [["user_id", 29]]

    def show
        @route = Route.find(params[:id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

    def create
        # debugger
         @route = Route.new(route_params)

        if @route.save
---
INSERT INTO "routes" ("user_id", "name", "description", "distance", "time", "elevation", "activity_type", "route_type", "thumbnail", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @route = Route.find(params[:id])
        # debugger
        if @route.update(route_params)
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "routes" SET "description" = $1, "updated_at" = $2 WHERE "routes"."id" = $3  [["description", "As the skylights turn off, the lights of Orlando turn on"], ["updated_at", "2020-04-09 02:01:19.538920"], ["id", 28]]

    def destroy
        @route = Route.find(params[:id])
        if @route.destroy
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 28]]