app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "fname", "lname", "gender", "location", "session_token", "password_digest", "created_at", "updated_at", "birthday") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "fname" = $1, "lname" = $2, "birthday" = $3, "gender" = $4, "location" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["fname", "Bill"], ["lname", "Walton"], ["birthday", "1972-03-30"], ["gender", "M"], ["location", 76587], ["updated_at", "2020-04-07 16:08:37.493035"], ["id", 13]]
---
    def update
        @user = User.find(params[:id])
        # debugger
        if @user.update(user_params)