app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Ars1XM7WxuNRr5brgRvqLQ"], ["updated_at", "2020-04-09 13:53:50.129744"], ["id", 29]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save